//
//  DejimaViewModel.swift
//  AnimalCrossing
//
//  Created by Hira on 2020/5/25.
//  Copyright © 2020 1. All rights reserved.
//

import UIKit

class DejimaViewModel {
    
    let name: [String] = ["普通島1（可改為狼蛛島及鱘魚島）", "普通島2（可改為狼蛛島）", "螺旋島（可改造狼蛛島）", "池塘島（可改造狼蛛島）", "山島（不可改造狼蛛島）", "金錢島1 （不可改造狼蛛島）", "金錢島2（可改造蝎子島）", "竹島（可自製狼蛛島）", "水果島（可自製狼蛛島）", "花島（可自製狼蛛島）", "蠍子島/狼蛛島", "樹島1 （可改造成狼珠島）", "樹島2（不可改造狼蛛島）", "大魚島1 （不可改造成狼珠島）", "大魚島2 （可改造成狼珠島）", "垃圾島（可改造成狼珠島）", "鯊魚島", "瀑布島（不可改造為狼珠島）", "蠍子金礦島 （可改造為蠍子島）", "高地彎河島（可改造為狼珠島）"]
    let introduce: [String] = ["出現機率高，有兩層及一條河流及瀑布，出現的水果、花、蟲、石、魚都最為普通。但可以變種鱘魚島，出海口在右邊，沒有池塘的可作鱘魚島，把二層的魚和瀑布下面的魚趕走，出海口必出鱘魚！", "出現機率高，有兩層及一條河流及瀑布，出現的水果、花、蟲、石、魚都最為普通。但可改為狼蛛島。", "雖然結構獨特，不過資源同普通島差不多，無特別。不過可以改造成狼蛛島。", "兩層島，沒有河流，只有一個大池塘，池塘會出錦鯉和金魚。季節限定期間可在17:00後會刷出大藍閃蝶。落雪、落雨不會出現。", "三層島，全島無河流、池糖。第2層有果樹，最頂層有5舊石，可以敲出蜈蚣。不可改造為狼蛛島。", "為單層島，被水域環繞，中間一個小島，上面有5舊石，可以敲碎北面一個石頭，用撐桿跳過去。小島的石頭會敲出鈴錢。不可改造成狼蛛島。", "島上有四個三角形懸崖，位於島上4個角落，島上滿佈鮮花，地面上7舊石頭岩石可敲出鈴錢。 晚上可刷蝎子。", "單層島，島上除只有竹子同椰樹，可掘出春筍。是改造成狼蛛島的好選擇。", "約有19棵非本地出產果樹，可以刷到跟自己島不同的水果。不過每個人只可刷出一種非本地產，其它要交換先有，可以改造成狼蛛島。", "單層島，中間有一個大池塘，池塘四周種滿特殊顏色花朵。", "單層島，中心島上有一條細小河流環繞，不用撐桿跳都跳得過。只在19:00~04:00出現。根據當時活躍的昆蟲種類，島上會刷新狼蛛或蠍子。", "全島無河流或池塘，與竹子島地形相同，分別是沒有竹, 有大量樹木同椰子樹。較容易捉跟樹和花有關的蟲，可改造狼蛛島。", "全島無河流或池塘，有兩處兩層高地及三層高地，有大量樹木同椰子樹。較容易捉跟樹和花有關的蟲，不可改造狼蛛島。", "三層島，全島水中只有大魚或特大魚身影，可以刷到特殊顏色花朵。", "全島水中只有大魚或特大魚身影，但就無特殊顏色花。", "雙層島，可以釣到的都是垃圾，但水中會有田鱉。", "水中的魚全部都有魚鰭，包括：鯊魚、翻車魚、吸盤魚。季節限定，即該島出現必須符合至少一種魚是當季有，才能出現。河流不會刷魚，用魚餌也不會有魚出現。", "三層島，全島得一個出海口，入海口容易釣到鱘魚。", "單層島，有一片水域環繞住一個小島。小島上有一塊可敲出金礦或石頭。只有蠍子活躍時期出現，島上會不停刷出蠍子。", "兩層島，多針葉樹，可改造為狼珠島。特定月份(南半球12月～3月，北半球6月～9月)期間晚上在高地可釣到遠東哲羅魚。"]
}
